<?xml version="1.0"?>
<net name="main_graph" version="11">
	<layers>
		<layer id="0" name="images" type="Parameter" version="opset1">
			<data shape="1,3,416,416" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="images">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="onnx::Conv_935_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 3, 5, 5" offset="0" size="2400" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_935">
					<dim>16</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="onnx::Conv_935" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="/backbone/stem/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="2, 2" dilations="1, 1" pads_begin="2, 2" pads_end="2, 2" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>416</dim>
					<dim>416</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>3</dim>
					<dim>5</dim>
					<dim>5</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Reshape_222_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2400" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Reshape_222" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="/backbone/stem/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/stem/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="/backbone/stem/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/stem/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Reshape_232_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="2432" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Reshape_232" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="/backbone/dark2/dark2.0/dconv/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>208</dim>
					<dim>208</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Reshape_282_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="2720" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Reshape_282" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="/backbone/dark2/dark2.0/dconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.0/dconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="onnx::Conv_941_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 16, 1, 1" offset="2752" size="1024" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_941">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="onnx::Conv_941" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="/backbone/dark2/dark2.0/pconv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Reshape_295_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="3776" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Reshape_295" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="/backbone/dark2/dark2.0/pconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.0/pconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="/backbone/dark2/dark2.0/pconv/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark2/dark2.0/pconv/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="onnx::Conv_944_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="3840" size="1024" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_944">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="onnx::Conv_944" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="/backbone/dark2/dark2.1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Reshape_309_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="4864" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Reshape_309" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="/backbone/dark2/dark2.1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="/backbone/dark2/dark2.1/conv1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark2/dark2.1/conv1/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="onnx::Conv_950_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="4896" size="512" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_950">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="onnx::Conv_950" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Reshape_337_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5408" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Reshape_337" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/m/m.0/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="/backbone/dark2/dark2.1/m/m.0/conv1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark2/dark2.1/m/m.0/conv1/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Reshape_347_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 1, 1, 3, 3" offset="5440" size="288" />
			<output>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Reshape_347" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="/backbone/dark2/dark2.1/m/m.0/conv2/dconv/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Reshape_397_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="5728" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Reshape_397" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="/backbone/dark2/dark2.1/m/m.0/conv2/dconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/m/m.0/conv2/dconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="onnx::Conv_956_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 16, 1, 1" offset="5760" size="512" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_956">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="onnx::Conv_956" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="/backbone/dark2/dark2.1/m/m.0/conv2/pconv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Reshape_410_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="6272" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Reshape_410" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="/backbone/dark2/dark2.1/m/m.0/conv2/pconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/m/m.0/conv2/pconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="/backbone/dark2/dark2.1/m/m.0/conv2/pconv/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark2/dark2.1/m/m.0/conv2/pconv/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="/backbone/dark2/dark2.1/m/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/m/m.0/Add_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="onnx::Conv_947_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="16, 32, 1, 1" offset="6304" size="1024" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_947">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="onnx::Conv_947" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="/backbone/dark2/dark2.1/conv2/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>16</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Reshape_323_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 16, 1, 1" offset="7328" size="32" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Reshape_323" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="/backbone/dark2/dark2.1/conv2/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/conv2/conv/Conv_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="/backbone/dark2/dark2.1/conv2/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark2/dark2.1/conv2/act/Relu_output_0">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="/backbone/dark2/dark2.1/Concat" type="Concat" version="opset1">
			<data axis="1" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>16</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/Concat_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="onnx::Conv_959_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="7360" size="2048" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_959">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="onnx::Conv_959" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="/backbone/dark2/dark2.1/conv3/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Reshape_426_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="9408" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Reshape_426" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="/backbone/dark2/dark2.1/conv3/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark2/dark2.1/conv3/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="/backbone/dark2/dark2.1/conv3/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark2/dark2.1/conv3/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Reshape_436_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="9472" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Reshape_436" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="/backbone/dark3/dark3.0/dconv/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="2, 2" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>104</dim>
					<dim>104</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Reshape_486_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="10048" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Reshape_486" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="/backbone/dark3/dark3.0/dconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark3/dark3.0/dconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="onnx::Conv_965_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="64, 32, 1, 1" offset="10112" size="4096" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_965">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="onnx::Conv_965" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="/backbone/dark3/dark3.0/pconv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>64</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Reshape_499_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 64, 1, 1" offset="14208" size="128" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Reshape_499" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="/backbone/dark3/dark3.0/pconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark3/dark3.0/pconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="/backbone/dark3/dark3.0/pconv/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark3/dark3.0/pconv/act/Relu_output_0">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="onnx::Conv_968_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 64, 1, 1" offset="14336" size="4096" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_968">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="onnx::Conv_968" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="/backbone/dark3/dark3.1/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>64</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>64</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Reshape_513_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="18432" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Reshape_513" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="/backbone/dark3/dark3.1/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark3/dark3.1/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="/backbone/dark3/dark3.1/conv1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark3/dark3.1/conv1/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="onnx::Conv_974_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="18496" size="2048" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_974">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="onnx::Conv_974" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Reshape_541_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="20544" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Reshape_541" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark3/dark3.1/m/m.0/conv1/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="/backbone/dark3/dark3.1/m/m.0/conv1/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark3/dark3.1/m/m.0/conv1/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Reshape_551_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 1, 1, 3, 3" offset="20608" size="576" />
			<output>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Reshape_551" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="/backbone/dark3/dark3.1/m/m.0/conv2/dconv/conv/Conv/WithoutBiases" type="GroupConvolution" version="opset1">
			<data strides="1, 1" pads_begin="1, 1" pads_end="1, 1" dilations="1, 1" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
					<dim>3</dim>
					<dim>3</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Reshape_601_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="21184" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Reshape_601" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="/backbone/dark3/dark3.1/m/m.0/conv2/dconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark3/dark3.1/m/m.0/conv2/dconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="onnx::Conv_980_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="32, 32, 1, 1" offset="21248" size="2048" />
			<output>
				<port id="0" precision="FP16" names="onnx::Conv_980">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="98" name="onnx::Conv_980" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="/backbone/dark3/dark3.1/m/m.0/conv2/pconv/conv/Conv/WithoutBiases" type="Convolution" version="opset1">
			<data strides="1, 1" dilations="1, 1" pads_begin="0, 0" pads_end="0, 0" auto_pad="explicit" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Reshape_614_compressed" type="Const" version="opset1">
			<data element_type="f16" shape="1, 32, 1, 1" offset="23296" size="64" />
			<output>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Reshape_614" type="Convert" version="opset1">
			<data destination_type="f32" />
			<rt_info>
				<attribute name="decompression" version="0" />
			</rt_info>
			<input>
				<port id="0" precision="FP16">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="/backbone/dark3/dark3.1/m/m.0/conv2/pconv/conv/Conv" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="/backbone/dark3/dark3.1/m/m.0/conv2/pconv/conv/Conv_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="/backbone/dark3/dark3.1/m/m.0/conv2/pconv/act/Relu" type="ReLU" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32" names="/backbone/dark3/dark3.1/m/m.0/conv2/pconv/act/Relu_output_0">
					<dim>1</dim>
					<dim>32</dim>
					<dim>52</dim>
					<dim>52</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="/backbone/dark3/dark3.1/m/m.0/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
